{
    "movq %rax": 2,
    "nop %edi %edx": 3,
    "retq": 4,
    "jmp": 5,
    "jb": 6,
    "movl %eax": 7,
    "cmp %rax %r12": 8,
    "sub $0x1 %rax": 9,
    "cmpb $0xa (%rax)": 10,
    "jz 0x111": 11,
    "movq %rdi": 12,
    "movq %rdx": 13,
    "callq": 14,
    "popq %rbx": 15,
    "pushq %rbx": 16,
    "lea %rax": 17,
    "jnz": 18,
    "popq %r12": 19,
    "popq %rbp": 20,
    "pushq %rbp": 21,
    "test %eax %eax": 22,
    "movl %r9d": 23,
    "pushq %r12": 24,
    "movq %rcx": 25,
    "cmpq $0x0": 26,
    "popq %r14": 27,
    "popq %r13": 28,
    "pushq %r14": 29,
    "movq %r8": 30,
    "test %rdx %rdx": 31,
    "popq %r15": 32,
    "pushq %r15": 33,
    "movq %rsi": 34,
    "pushq %r13": 35,
    "jmpq": 36,
    "mov %rdi %rax": 37,
    "jz": 38,
    "movzxb %eax": 39,
    "cmp %rdx %rbx": 40,
    "mov %r12 %rdi": 41,
    "movl %edx": 42,
    "movq %rbx": 43,
    "movq %r9": 44,
    "mov %rdi %rbp": 45,
    "mov %rdx %rbx": 46,
    "movl %ecx": 47,
    "movl $0x0": 48,
    "lea %rsi": 49,
    "cdqe": 50,
    "movl %ebx": 51,
    "xor %eax %eax": 52,
    "mul %rcx": 53,
    "movl (%rbp) %eax": 54,
    "cmp %rax %r15": 55,
    "add $0x18 %rsp": 56,
    "sub $0x18 %rsp": 57,
    "mov %rdi %rbx": 58,
    "mov %rsi %r12": 59,
    "test %ebx %ebx": 60,
    "mov %rax %rdx": 61,
    "test %rax %rax": 62,
    "movq $0x0": 63,
    "mov %r13 %rax": 64,
    "test %edx %edx": 65,
    "mov %r12 %rsi": 66,
    "jnbe": 67,
    "sub $0x8 %rsp": 68,
    "sub %rdi %rdx": 69,
    "add $0x8 %rsp": 70,
    "jmp 0xd": 71,
    "mov %rdx %r13": 72,
    "cmp $0x20 %rdx": 73,
    "lea %eax": 74,
    "cmp $0x10 %dl": 75,
    "jb 0x4b": 76,
    "xor %r13d %r13d": 77,
    "cmp %eax": 78,
    "jnb 0x19": 79,
    "movl (%rdi) %eax": 80,
    "add %rdx %rax": 81,
    "jz 0x5f": 82,
    "add $0x4 %r15": 83,
    "mov %rbx %r14": 84,
    "cmpq %rax": 85,
    "mov %rax": 86,
    "": 87,
    "%ymm1 %eax": 88,
    "and $0xa00 %eax": 89,
    "cmp $0xa00 %eax": 90,
    "jz 0x5c": 91,
    "mov %rbx %r13": 92,
    "jnz 0xa": 93,
    "add %r13 %r12": 94,
    "sub %r13 %r14": 95,
    "jnz 0x44": 96,
    "add %r14 %r15": 97,
    "jbe 0xa7": 98,
    "cmpl %eax": 99,
    "cmovbe %rbx %rdx": 100,
    "movq %r15": 101,
    "and $0x3f %ecx": 102,
    "cmp %rcx %rax": 103,
    "add %rdi %rax": 104,
    "tzcnt %eax %eax": 105,
    "mov %edi %ecx": 106,
    "cmpq %rdx": 107,
    "cmp $0x20 %ecx": 108,
    "mov %eax": 109,
    "mov %r15 %rdx": 110,
    "mov %rdx %rdi": 111,
    "cmp $0x8 %dl": 112,
    "jnb 0x29": 113,
    "test %r9d %r9d": 114,
    "cmp $0x9 %rax": 115,
    "shr $0x3 %rdx": 116,
    "sub %rax %r9": 117,
    "mov %rdi %r9": 118,
    "sub $0x1 %r8": 119,
    "movb %al (%r8)": 120,
    "add %rax %rax": 121,
    "test %ecx %ecx": 122,
    "sub %r9d %eax": 123,
    "sub %r14 %rbx": 124,
    "add $0x1 %eax": 125,
    "mov %r13 %rdi": 126,
    "movl %r10d": 127,
    "xor %r15d %r15d": 128,
    "vmovd %esi %xmm0": 129,
    "%xmm0 %ymm0": 130,
    "%ymm8 %ymm9 %ymm2": 131,
    "%ymm8 %ymm0 %ymm1": 132,
    "vpor %ymm1 %ymm2 %ymm1": 133,
    "(%rdi) %ymm8": 134,
    "jnle": 135,
    "movsxdl %rcx": 136,
    "cmp $0x4 %dl": 137,
    "addl $0x1": 138,
    "xor %ecx %ecx": 139,
    "sub $0x1 %eax": 140,
    "sub %rdx": 141,
    "jnb 0x35": 142,
    "mov $0x25 %esi": 143,
    "jnbe 0x36": 144,
    "vpxor %xmm9 %xmm9 %xmm9": 145,
    "mov %rsp %rbp": 146,
    "mov %rcx": 147,
    "movq %r12": 148,
    "movq %r10": 149,
    "cmp %rbx %r15": 150,
    "mov %rdi %rdx": 151,
    "test %rsi %rsi": 152,
    "lea %rbx": 153,
    "cmpl $0x10": 154,
    "lea %r8": 155,
    "xor %esi %esi": 156,
    "sub %rdx %rax": 157,
    "nopw %ax": 158,
    "mov %rax %rbx": 159,
    "mov %rsi %r15": 160,
    "mov %rdx": 161,
    "movq %r11": 162,
    "cmp $0x1 %dl": 163,
    "cmp $0x5a %al": 164,
    "mov %rbp %rdi": 165,
    "jz 0x185": 166,
    "movsx %r15b %eax": 167,
    "sub $0x20 %eax": 168,
    "test $0x8 %ah": 169,
    "mov %rdx %rcx": 170,
    "mov %rcx %r12": 171,
    "jnbe 0x3d": 172,
    "mov %esi %ebx": 173,
    "cmp %ecx %eax": 174,
    "lea %rdi": 175,
    "jz 0xc": 176,
    "movl %esi": 177,
    "test $0x8 %al": 178,
    "js 0x24": 179,
    "jz 0x52": 180,
    "cmp %ebx": 181,
    "mov %rax %r8": 182,
    "test %r9 %r9": 183,
    "mov %rdx %rax": 184,
    "mov %rdx %rsi": 185,
    "jnz 0x201": 186,
    "jz 0xbd": 187,
    "movzxb %r15d": 188,
    "mov %r12d %eax": 189,
    "test %r15 %r15": 190,
    "subq %rax": 191,
    "movl (%r15) %edx": 192,
    "cmp %ebx %edx": 193,
    "cmp %r15 %r12": 194,
    "cmp %rdx %rdi": 195,
    "sub $0x2 %rcx": 196,
    "jz 0xaf": 197,
    "add $0x30 %r12d": 198,
    "mov %r12 %rcx": 199,
    "movl %r14d": 200,
    "add $0x68 %rsp": 201,
    "jmp 0xf": 202,
    "sub $0x68 %rsp": 203,
    "cmp %rdx %r9": 204,
    "jle 0x3e": 205,
    "mov %r10 %rdi": 206,
    "movq (%r8) %rdi": 207,
    "jbe 0x126": 208,
    "add %r8 %r9": 209,
    "jle 0x2b": 210,
    "movq %rdx (%rsi)": 211,
    "movq (%rdx) %r12": 212,
    "jz 0x87": 213,
    "callq 0x1d5ad": 214,
    "jz 0x34": 215,
    "addq %rdx": 216,
    "test %r13 %r13": 217,
    "mov %eax %edx": 218,
    "jz 0x28d": 219,
    "cmp %edx %r13d": 220,
    "movb %dl (%rdi)": 221,
    "jbe 0x24": 222,
    "add $0x1 %rdi": 223,
    "and %rdi": 224,
    "jnb": 225,
    "and $0x1f %ecx": 226,
    "sub %rdx %rcx": 227,
    "add %r10 %rax": 228,
    "mov %rbx %r11": 229,
    "movq (%rsi) %rax": 230,
    "xor %r10 %r10": 231,
    "and $0x3 %ebx": 232,
    "adc $0x0 %rdx": 233,
    "cmp $0x2 %ebx": 234,
    "jz 0x5b": 235,
    "mov $0x1 %ebx": 236,
    "jz 0x16": 237,
    "sar %cl %eax": 238,
    "lea %rsp": 239,
    "add %rcx %rax": 240,
    "xorq %rax": 241,
    "mov %eax %ebx": 242,
    "mov %r8 %rsi": 243,
    "jnz 0x1519": 244,
    "js 0x2a7a": 245,
    "jbe 0x1482": 246,
    "cmpb $0x0 (%rbx)": 247,
    "add %r15d %r9d": 248,
    "mov %r8 %rdi": 249,
    "jnbe 0x239": 250,
    "mov %rbx %r15": 251,
    "sub %r8 %r15": 252,
    "add $0x1 %r8": 253,
    "xor %r10d %r10d": 254,
    "xorq %rcx": 255,
    "mov %r8d": 256,
    "xor %r11d %r11d": 257,
    "lea %rdx": 258,
    "mov %r13 %rsi": 259,
    "mov %rdi %rsi": 260,
    "jnle 0x44": 261,
    "mov $0xa %ecx": 262,
    "test %rbx %rbx": 263,
    "movl (%r14) %eax": 264,
    "cmp $0x2f %eax": 265,
    "cmp %rax %rcx": 266,
    "jz 0x1f": 267,
    "mov %rbx %rcx": 268,
    "test $0x2 %al": 269,
    "movzxw %ecx": 270,
    "sub %rax": 271,
    "test %r11 %r11": 272,
    "add $0x8 %eax": 273,
    "movl %eax (%r14)": 274,
    "mov %r11 %rsi": 275,
    "sub $0x10 %rsp": 276,
    "movq %rax (%rdi)": 277,
    "dec %r11": 278,
    "jmp 0xe5": 279,
    "jz 0xb": 280,
    "callq 0x1e31e": 281,
    "mov %ebx %esi": 282,
    "mov $0x1 %edx": 283,
    "movl %r15d": 284,
    "add $0x10 %rsp": 285,
    "movzxb %ecx": 286,
    "xor %ebx %ebx": 287,
    "movq %r14": 288,
    "movsxdl %rax": 289,
    "test %r8d %r8d": 290,
    "sub %r15 %rdx": 291,
    "mov %rbx %rdi": 292,
    "cmp $0xa %edx": 293,
    "jz 0xf6": 294,
    "jnz 0xb1": 295,
    "movb %bl (%rdx)": 296,
    "test $0x2 %ah": 297,
    "jz 0xa3": 298,
    "movzx %bl %eax": 299,
    "cmp $0xa %ebx": 300,
    "mov %r8 %rax": 301,
    "movq": 302,
    "mov %rbx %rax": 303,
    "test %al %al": 304,
    "movb %sil": 305,
    "testl (%r12)": 306,
    "jnz 0x15c": 307,
    "test %r11d %r11d": 308,
    "movl %r11d": 309,
    "test %rcx %rcx": 310,
    "mov %r13": 311,
    "mov %rbx %rdx": 312,
    "mov %rsi %r8": 313,
    "mov %r15": 314,
    "sub %r15 %r13": 315,
    "mov %rsp %rdx": 316,
    "movl $0x30": 317,
    "jz 0x3e": 318,
    "movq $0x1": 319,
    "jz 0x7c": 320,
    "mov %eax %esi": 321,
    "jb 0x7": 322,
    "movzxb (%rsi) %ecx": 323,
    "movb %cl (%rdi)": 324,
    "jmp %rax": 325,
    "mov %r9d %eax": 326,
    "cmp %rbx %rdi": 327,
    "jnz 0x3d": 328,
    "cmp %rdx %rcx": 329,
    "jz 0x33": 330,
    "cmpq %r15": 331,
    "mov %rcx %rdx": 332,
    "cmpl $0xa": 333,
    "setz %cl": 334,
    "sub $0x18 %r15": 335,
    "add %r12d %eax": 336,
    "sub $0x1 %r14d": 337,
    "mov %r14 %rax": 338,
    "and $0x1 %esi": 339,
    "jnz 0x9f": 340,
    "jz 0x48": 341,
    "test $0x8 %r15b": 342,
    "movl (%r12) %r15d": 343,
    "jnz 0x249b": 344,
    "jz 0x2a99": 345,
    "and $0x2 %ebx": 346,
    "mov %r15d %ebx": 347,
    "jnz 0x425": 348,
    "and %r15d": 349,
    "jnz 0x9e": 350,
    "jbe 0x354": 351,
    "sub %rcx": 352,
    "jnz 0x285": 353,
    "cmp %r15": 354,
    "jnle 0x348": 355,
    "mov %r15d %r9d": 356,
    "cmpb $0x0 (%rdi)": 357,
    "jz 0x1ad": 358,
    "orl %eax": 359,
    "jl": 360,
    "jnz 0x19": 361,
    "jnz 0x2d5c": 362,
    "add $0xd8 %rsp": 363,
    "movl $0xa": 364,
    "js 0xa85": 365,
    "mov %rax %r11": 366,
    "jnl 0x7bb": 367,
    "sub %r11 %rcx": 368,
    "cmp %rbx %rcx": 369,
    "jz 0x670": 370,
    "mov %ebx %r8d": 371,
    "sub %rcx %rbx": 372,
    "jz 0x932": 373,
    "cmpb $0x20": 374,
    "jz 0x6b": 375,
    "jnle 0xa21": 376,
    "add %r8d %ebx": 377,
    "js 0x1eea": 378,
    "jbe 0x1555": 379,
    "addl %r9d": 380,
    "jz 0x9e1": 381,
    "js 0xb40": 382,
    "cmp $0x58 %r15b": 383,
    "cmovz %rax %rsi": 384,
    "jz 0x72": 385,
    "movupsx %xmm1": 386,
    "movdqux (%r14) %xmm1": 387,
    "sub %r13 %r15": 388,
    "jz 0x26": 389,
    "subl $0x1 (%rdi)": 390,
    "add $0x1 %rax": 391,
    "jz 0xd5": 392,
    "mov %rdx %r14": 393,
    "%edx (%rdi)": 394,
    "mov %rdx %rbp": 395,
    "jz 0x3f8": 396,
    "jnz 0x1d3f": 397,
    "jnz 0x1ad6": 398,
    "jz 0x39": 399,
    "sub $0xd8 %rsp": 400,
    "test %rbp %rbp": 401,
    "mov %rdi %r10": 402,
    "jz 0x5d7": 403,
    "jnz 0x52e": 404,
    "jnbe 0x7b4": 405,
    "movsxdl (%rdx) %r11": 406,
    "jmp 0x2b": 407,
    "jnz 0x1d16": 408,
    "jnz 0x120": 409,
    "jnz 0x112": 410,
    "mov %edx %ebx": 411,
    "and $0x8 %eax": 412,
    "and $0x2 %esi": 413,
    "mov $0x0 %al": 414,
    "mov $0x0 %edx": 415,
    "and $0x1 %eax": 416,
    "mov %esi": 417,
    "movl $0x8 (%rsp)": 418,
    "mov %r10 %rsi": 419,
    "jle": 420,
    "test %cl %cl": 421,
    "jnz 0x62": 422,
    "mov $0x1 %eax": 423,
    "lea %r15": 424,
    "cmp %rax": 425,
    "jbe 0x6d": 426,
    "movzxb %edx": 427,
    "test %r8 %r8": 428,
    "movl %edi": 429,
    "xor %edx %edx": 430,
    "mov %rdi %r13": 431,
    "jz 0xc1": 432,
    "jnz 0x1c": 433,
    "cmpl $0x8": 434,
    "cmovs %rdx %rbx": 435,
    "sub %ecx %edx": 436,
    "mov %r10d %edx": 437,
    "sub %ebx %edx": 438,
    "jz 0x4a": 439,
    "test %r14 %r14": 440,
    "lea %rcx": 441,
    "movzxw %eax": 442,
    "test %rdi %rdi": 443,
    "add $0x1 %r15": 444,
    "mov %rdi": 445,
    "jle 0x17e0": 446,
    "cmp %rsi %rdx": 447,
    "mov %r12 %rax": 448,
    "mov %r14 %r8": 449,
    "movupsx %xmm0": 450,
    "sub $0x1 %rdx": 451,
    "movw %cx": 452,
    "movw %si (%rdi)": 453,
    "movzxw (%rsi) %esi": 454,
    "movl %esi (%rdi)": 455,
    "syscall": 456,
    "movzxb %esi": 457,
    "jbe 0xd": 458,
    "mov %r14 %rdx": 459,
    "and %rax": 460,
    "mov %rbp %rsi": 461,
    "%xmm1": 462,
    "jz 0x7": 463,
    "mov %rax %r13": 464,
    "jz 0x42": 465,
    "test %r12d %r12d": 466,
    "sub %rbx %rax": 467,
    "%xmm0 (%rdi)": 468,
    "jnl 0x7d": 469,
    "(%rsi) %xmm0": 470,
    "mov %edi %ebx": 471,
    "jnz 0x7": 472,
    "sub %rax %rbx": 473,
    "jnz 0xc": 474,
    "mov %esi %r14d": 475,
    "add %rsi %rax": 476,
    "callq 0x3139": 477,
    "mov %rsi %rbp": 478,
    "mov %rdi %r12": 479,
    "jbe 0x12": 480,
    "cmp %rcx": 481,
    "cmpq %rbx": 482,
    "mov %rdi %rcx": 483,
    "jz 0x3f": 484,
    "movl (%rsi) %esi": 485,
    "jnz 0x12": 486,
    "sub $0x8 %rcx": 487,
    "div %rdi": 488,
    "shl $0x3 %rcx": 489,
    "neg %eax": 490,
    "jnle 0xf": 491,
    "mov %r14d %edi": 492,
    "addl %ebx": 493,
    "cmp %rax %r8": 494,
    "movb %al": 495,
    "mov %rdx %r12": 496,
    "sub %rsi %rdx": 497,
    "testb $0x2": 498,
    "test %ax %ax": 499,
    "mov %eax %r9d": 500,
    "cmp %r13d %eax": 501,
    "jmp 0x1a": 502,
    "jnz 0x9": 503,
    "mov %rbp %rdx": 504,
    "setnz %al": 505,
    "cmp %rdx %r13": 506,
    "jbe 0x1ac": 507,
    "jz 0x150": 508,
    "subq %rcx": 509,
    "cmp $0x7f %rcx": 510,
    "movq %r13": 511,
    "cmp %rax %r13": 512,
    "cmp $0x9 %sil": 513,
    "jbe 0x1d": 514,
    "lea %esi": 515,
    "(%rdi) %ymm0 %ymm1": 516,
    "jnl 0x1e": 517,
    "movzx %sil %ecx": 518,
    "cmp %edx %ecx": 519,
    "cmp %r14 %rdi": 520,
    "movzx %sil %esi": 521,
    "imul %r15 %rax": 522,
    "sub $0x1 %rbp": 523,
    "mov %r15 %r14": 524,
    "jnz 0xc7": 525,
    "jnbe 0x53": 526,
    "js 0x30": 527,
    "add %rax %rbp": 528,
    "jle 0x55": 529,
    "js 0xc": 530,
    "jnz 0x6d": 531,
    "testl $0x202 (%rbx)": 532,
    "jbe 0xb2": 533,
    "cmp %r13 %rbp": 534,
    "jle 0x3b": 535,
    "sub %r15 %rax": 536,
    "movsxdl %rdx": 537,
    "testl (%rdi)": 538,
    "jle 0x84": 539,
    "movzxb (%r14) %esi": 540,
    "jnz 0xc5": 541,
    "mov %rsi %r14": 542,
    "sub %r12 %rax": 543,
    "mov $0x1 %r15d": 544,
    "sub %r14d %eax": 545,
    "jz 0xfb": 546,
    "add %rbx %rdx": 547,
    "jz 0x4e": 548,
    "sub $0x1 %ecx": 549,
    "jnz 0xb": 550,
    "movsxd %edx %rdx": 551,
    "xor %r8d %r8d": 552,
    "movb %dl": 553,
    "test %r12 %r12": 554,
    "cmp $0x9 %eax": 555,
    "jz 0x24": 556,
    "movq %rsi (%rdi)": 557,
    "add $0x1 %r13d": 558,
    "testb $0x20": 559,
    "sub %rdx %r8": 560,
    "vpxor %xmm0 %xmm0 %xmm0": 561,
    "movl %r13d": 562,
    "mov %edx %eax": 563,
    "jnz 0x4b": 564,
    "div %rcx": 565,
    "sub %ebx %r10d": 566,
    "jz 0x149": 567,
    "cmp $0x2e %eax": 568,
    "lea %r14": 569,
    "mov %r14 %rdi": 570,
    "xor %r14d %r14d": 571,
    "test %r13d %r13d": 572,
    "mov %rbx %rsi": 573,
    "cmp %rbx %rax": 574,
    "lea %r13": 575,
    "jnbe 0x2d": 576,
    "test %esi %esi": 577,
    "mov %rcx %rax": 578,
    "movq (%rsi) %rsi": 579,
    "orq $0x0": 580,
    "lea %r10d": 581,
    "cmp $0x14 %rbx": 582,
    "jz 0x70": 583,
    "lea %edx": 584,
    "jz 0x17": 585,
    "callq 0x52634": 586,
    "add $0x1 %edx": 587,
    "and $0x2 %eax": 588,
    "setnle %al": 589,
    "cdq": 590,
    "jns": 591,
    "sub %r14 %rax": 592,
    "jmp 0x58": 593,
    "add $0x1 %ebx": 594,
    "jbe": 595,
    "jnbe 0x209": 596,
    "jnle 0x1f9": 597,
    "jz 0x448": 598,
    "mov %r14d %r10d": 599,
    "sub %eax %r12d": 600,
    "cmp %r14d": 601,
    "movb %r10b (%rbx)": 602,
    "jz 0x186": 603,
    "jnb 0x3da": 604,
    "movzxw %edx": 605,
    "movl $0x1": 606,
    "and $0xfff %edx": 607,
    "mov %rax %r14": 608,
    "cmpl $0x12c": 609,
    "mov %rax %r15": 610,
    "callq 0x35458": 611,
    "movl %r8d": 612,
    "add %ebx %r9d": 613,
    "add $0x8 %rbx": 614,
    "jz 0x8": 615,
    "sub %rdx %rsp": 616,
    "cmp %rbx %rbp": 617,
    "mov %edx": 618,
    "movzxb (%rax) %r15d": 619,
    "cmovbe %rbp %rbx": 620,
    "sub %rdi %rbx": 621,
    "jnz 0xad": 622,
    "cmp $0x1e %rax": 623,
    "cmp $0xe %rax": 624,
    "jbe 0x63": 625,
    "add %rbx %r14": 626,
    "add %rbx %rdi": 627,
    "sub %rbx %rbp": 628,
    "mov %r8 %rbx": 629,
    "shl $0x3 %rdx": 630,
    "cmpw (%r12) %bp": 631,
    "jnl 0x3f": 632,
    "movq (%rdx) %r11": 633,
    "test %bl %bl": 634,
    "sub $0x30 %edx": 635,
    "cmp $0x9 %edx": 636,
    "jnz 0xf1": 637,
    "addl %eax": 638,
    "idiv %ecx": 639,
    "test %ebp %ebp": 640,
    "movb %cl": 641,
    "movq %rbp": 642,
    "movw %ax": 643,
    "and %rdx": 644,
    "movzxb (%rax) %r14d": 645,
    "movl": 646,
    "movsdq %xmm0": 647,
    "jz 0x11": 648,
    "xorq %rbx": 649,
    "jnz 0x2a": 650,
    "shl $0x6 %ecx": 651,
    "sbb %eax %eax": 652,
    "neg %r11": 653,
    "mov %r15 %rdi": 654,
    "jz 0x106f": 655,
    "jns 0x12": 656,
    "callq 0x1b885": 657,
    "cmp %rdx %rax": 658,
    "xor %r12d %r12d": 659,
    "jnz 0x10": 660,
    "lea %ecx": 661,
    "mov %ebx %edi": 662,
    "add $0x28 %rsp": 663,
    "callq 0xb409": 664,
    "jnbe 0x188e": 665,
    "jz 0x1216": 666,
    "jnz 0x1928": 667,
    "cmp $0x53 %r15b": 668,
    "jz 0x191e": 669,
    "cmp %r8d": 670,
    "jz 0x1b0c": 671,
    "jns 0x11d1": 672,
    "js 0x2a6f": 673,
    "jbe 0x25b1": 674,
    "jnbe 0x6a1": 675,
    "mov %r11 %rdi": 676,
    "sub $0x28 %rsp": 677,
    "and $0x3 %eax": 678,
    "cmp $0x2 %eax": 679,
    "jnb 0x2a": 680,
    "sub $0x2 %rdx": 681,
    "movq (%rcx) %rcx": 682,
    "jnz 0x20": 683,
    "and %eax": 684,
    "subl $0x1": 685,
    "js": 686,
    "add %r8 %rdx": 687,
    "mov %rbp %rcx": 688,
    "jle 0x20": 689,
    "xor %r9d %r9d": 690,
    "movsxd %ecx %rcx": 691,
    "mov %rsp %rbx": 692,
    "testb $0x8": 693,
    "shl %cl %eax": 694,
    "add $0x4 %r11": 695,
    "add %rax %r9": 696,
    "adc %r8 %rdx": 697,
    "test %r14d %r14d": 698,
    "sub $0x58 %rsp": 699,
    "cmp $0x1 %rcx": 700,
    "jnbe 0x1e9": 701,
    "callq 0x248": 702,
    "cmp $0x1 %rbx": 703,
    "jnz 0x442": 704,
    "jnl 0xbb": 705,
    "jnle 0x85": 706,
    "mov %rsi": 707,
    "movq (%r15) %rcx": 708,
    "jz 0x794": 709,
    "callq 0x1d17c": 710,
    "mov %edx %ecx": 711,
    "%edx": 712,
    "add %rax %rbx": 713,
    "movl (%rbx) %eax": 714,
    "cmp %r9d": 715,
    "%xmm1 %xmm0": 716,
    "movzxb (%rax) %ebx": 717,
    "movzx %al %eax": 718,
    "mov %rax %rdi": 719,
    "movsxd %r15d %rax": 720,
    "movb %r15b (%r14)": 721,
    "jle 0xc": 722,
    "jnb 0xca1": 723,
    "add $0x1 %al": 724,
    "%xmm0 %xmm0": 725,
    "xor $0x3f %rax": 726,
    "bsrq %rax": 727,
    "sub %eax %r10d": 728,
    "shl $0x2 %rax": 729,
    "mov %rbx %r8": 730,
    "mov $0xa %edx": 731,
    "movq %rsi (%rsp)": 732,
    "lea %r12": 733,
    "jnl 0x6d": 734,
    "cmp %r10d": 735,
    "test $0x4 %al": 736,
    "callq 0x5fa64": 737,
    "mov %ebx %eax": 738,
    "jnz 0x35c8": 739,
    "mov %rsi %r13": 740,
    "and %rsi": 741,
    "jnl 0x88": 742,
    "subl %ecx": 743,
    "mov %rax %rcx": 744,
    "mov %r14 %r15": 745,
    "mov %rax %rsi": 746,
    "neg %rdx": 747,
    "pxor %xmm0 %xmm0": 748,
    "mov %r14d %ecx": 749,
    "jnl 0x8e": 750,
    "and %edx": 751,
    "or %eax %r13d": 752,
    "mov %r10d %r12d": 753,
    "mov %edi": 754,
    "jz 0x3d": 755,
    "or $0x1 %eax": 756,
    "movhpsq %xmm0": 757,
    "movl %eax (%rbx)": 758,
    "cmpq %rdi": 759,
    "mov %r14 %r13": 760,
    "jle 0x4a": 761,
    "movl %eax (%rcx)": 762,
    "jnz 0xf": 763,
    "movzxb (%rsi) %eax": 764,
    "mov %eax %ecx": 765,
    "mov %r13d %eax": 766,
    "cmp %r15d": 767,
    "mov %edx %r15d": 768,
    "mov %r13 %r14": 769,
    "add $0x1 %rsi": 770,
    "mov $0x30 %eax": 771,
    "cmovz %eax %esi": 772,
    "jbe 0x31": 773,
    "jmp 0x231b": 774,
    "cmp $0x24 %r15b": 775,
    "cmp %rax %rdx": 776,
    "cmovsq %rbx": 777,
    "add %ecx %ebx": 778,
    "mov %r10d %ebx": 779,
    "mov %r15d %ecx": 780,
    "jnle 0x43": 781,
    "jnz 0x24": 782,
    "sub %edx %eax": 783,
    "callq 0x356a8": 784,
    "add $0x1 %ecx": 785,
    "mov $0x1 %esi": 786,
    "movqq (%rsp) %xmm0": 787,
    "cmovnz %edx %eax": 788,
    "cmpl $0x1": 789,
    "sub $0x20 %rsp": 790,
    "mov %ecx %ebp": 791,
    "jnz 0x36": 792,
    "add $0x20 %rsp": 793,
    "jnz 0xe4": 794,
    "jz 0x1d": 795,
    "callq 0x52784": 796,
    "cmpl $0x14": 797,
    "jnz 0x3e": 798,
    "mov %r8d %eax": 799,
    "lea %ebx": 800,
    "movzx %cl %ecx": 801,
    "movl %r12d": 802,
    "add $0x20 %rdi": 803,
    "mov %cl %dl": 804,
    "add $0x1 %dl": 805,
    "jz 0x9": 806,
    "jnz 0x45": 807,
    "callq 0xf102": 808,
    "mov %edi %eax": 809,
    "jnl 0x15": 810,
    "or %edx %eax": 811,
    "cmp $0x2 %edx": 812,
    "imull $0x3 %eax": 813,
    "mov $0x5 %ecx": 814,
    "addq %rax": 815,
    "cmp %rax %rsp": 816,
    "mov %ecx %edx": 817,
    "jz 0x15": 818,
    "jb 0x10": 819,
    "movq (%rsi) %r8": 820,
    "shrd %cl %r8 %rax": 821,
    "sub $0x3 %rdx": 822,
    "shr %cl %r9": 823,
    "movq %r8 (%rdi)": 824,
    "shrd %cl %r9 %r8": 825,
    "js 0x3c": 826,
    "mov %rax %r10": 827,
    "mov %rdx %r9": 828,
    "jmp 0x5e": 829,
    "xor %r8 %r8": 830,
    "or %esi": 831,
    "sar $0x6 %edx": 832,
    "lea %rbp": 833,
    "movq %r13 %xmm0": 834,
    "mov %r15 %r12": 835,
    "movqq %xmm0": 836,
    "add %rax %r14": 837,
    "sub %r13 %rdx": 838,
    "jnz 0x6e": 839,
    "movdqax (%rsp) %xmm0": 840,
    "fld %st": 841,
    "cmp %rbx %r14": 842,
    "movapsx %xmm0 (%rsp)": 843,
    "mov $0xa %r13d": 844,
    "xor %ebp %ebp": 845,
    "mov %r8": 846,
    "movl (%rax) %eax": 847,
    "movzxw %esi": 848,
    "movapsx %xmm0": 849,
    "movq %rax %xmm0": 850,
    "jz 0x88": 851,
    "cmp $0x30 %esi": 852,
    "nopl %eax": 853,
    "jnz 0x4e": 854,
    "jnz 0x1f": 855,
    "movupsx %xmm0 (%rdi)": 856,
    "movq %r8 %xmm1": 857,
    "jnz 0x53": 858,
    "cmp $0x1 %edx": 859,
    "cmp $0x24 %edx": 860,
    "jnbe 0x17c": 861,
    "cmp %r8 %r9": 862,
    "cmp $0x2d %cl": 863,
    "jz 0x189": 864,
    "cmp $0x30 %cl": 865,
    "mov %rdx %r15": 866,
    "cmp $0x2b %cl": 867,
    "jz 0x5": 868,
    "callq 0x56d48": 869,
    "cmp %rcx %r9": 870,
    "add $0x4 %rcx": 871,
    "addl (%rcx) %edx": 872,
    "movl %edx (%rsi)": 873,
    "add $0x4 %r8": 874,
    "shr $0x1 %edx": 875,
    "movq (%rdi) %rcx": 876,
    "movl (%r8) %edx": 877,
    "mov %r13 %rbx": 878,
    "movsxb (%r13) %rax": 879,
    "movsxd %edx %r15": 880,
    "cmovnz %rdx %rax": 881,
    "jz 0x81": 882,
    "callq 0x434": 883,
    "jz 0x1dd": 884,
    "jz 0xe7": 885,
    "jz 0x3c4": 886,
    "jz 0x282": 887,
    "jz 0x218": 888,
    "add %rcx %rdx": 889,
    "jnbe 0x21": 890,
    "movb $0x5": 891,
    "jmp 0x30": 892,
    "jnz 0x2e6": 893,
    "movb $0x0": 894,
    "jnz 0x140": 895,
    "mov %ebx %edx": 896,
    "mov %eax %r14d": 897,
    "movzxb %r12d": 898,
    "jnz 0x3a7": 899,
    "jz 0x280": 900,
    "jz 0x289": 901,
    "test $0x1 %ah": 902,
    "sub %rax %rdx": 903,
    "jz 0x10": 904,
    "add %rcx %rcx": 905,
    "cmpb %sil": 906,
    "mov %eax %r15d": 907,
    "cmpl": 908,
    "movzxb (%rax) %eax": 909,
    "mov %r12 %r14": 910,
    "mov %r14 %rsi": 911,
    "mov $0x2 %esi": 912,
    "cmpb $0x0": 913,
    "mov $0x1 %ecx": 914,
    "add %eax %eax": 915,
    "cmp %r8 %rdx": 916,
    "mov %r8 %rdx": 917,
    "mov %eax %r13d": 918,
    "sub %rsi %rbx": 919,
    "cmp %rsi %rsp": 920,
    "sub %rax %rsi": 921,
    "movzx %dl %edx": 922,
    "fstp %st": 923,
    "jnl 0x15a": 924,
    "jnl 0x59": 925,
    "sub %r13 %rax": 926,
    "movsxd %eax %rcx": 927,
    "jnz 0xdb": 928,
    "jb 0xc4": 929,
    "movsxw %eax": 930,
    "cmpl $0x64": 931,
    "mov %r14 %r12": 932,
    "add $0x1 %r14": 933,
    "mov %ecx %esi": 934,
    "jnz 0x30": 935,
    "jnbe 0x2b": 936,
    "movl (%r12) %eax": 937,
    "jnz 0x3c41": 938,
    "jz 0x543e": 939,
    "jz 0x480": 940,
    "jz 0x27cd": 941,
    "jz 0x142": 942,
    "cmp $0x25 %bl": 943,
    "movq %rax %xmm3": 944,
    "jnbe 0x295": 945,
    "%xmm3 %xmm0": 946,
    "jnbe 0x64": 947,
    "cmp $0x22 %cl": 948,
    "jbe 0x484": 949,
    "sub $0x30 %eax": 950,
    "movzxb (%r13) %r12d": 951,
    "cmp $0x2e %al": 952,
    "test %r12b %r12b": 953,
    "jz 0x1178": 954,
    "jbe 0xa67": 955,
    "cmp $0x2b %dl": 956,
    "mov %r8 %r14": 957,
    "jnb 0x270": 958,
    "jz 0x2f": 959,
    "and $0x20 %ch": 960,
    "jz 0x65d": 961,
    "movzx %sil %eax": 962,
    "andl (%rbx)": 963,
    "jnbe 0x1d52": 964,
    "cmp $0x53 %r12b": 965,
    "movzx %r12b %r12d": 966,
    "jnz 0xed": 967,
    "jbe 0x113": 968,
    "jbe 0x2a": 969,
    "jbe 0x9": 970,
    "jz 0x18": 971,
    "and $0xc00 %esi": 972,
    "movl (%rdi) %ecx": 973,
    "cmp $0xc00 %esi": 974,
    "jnb 0x27": 975,
    "jz 0x4fe": 976,
    "mov %r15d %r8d": 977,
    "jz 0x690": 978,
    "jnz 0x6d7": 979,
    "jnz 0x7114": 980,
    "add $0x1d0 %rsp": 981,
    "sub $0x1d0 %rsp": 982,
    "callq 0x16a60": 983,
    "callq 0x182f2": 984,
    "cmovnz %rcx %rdx": 985,
    "jz 0x745": 986,
    "cmpb $0x0 (%rcx)": 987,
    "jmp 0x38": 988,
    "mov %r15d %eax": 989,
    "movb %r12b": 990,
    "sub $0x25 %r12d": 991,
    "movzx %al %esi": 992,
    "callq 0x16552": 993,
    "jbe 0x8": 994,
    "cmp $0x1f %rax": 995,
    "not %eax": 996,
    "and $0x4 %eax": 997,
    "mov %r8d %r15d": 998,
    "movl $0x10": 999,
    "jle 0x2d": 1000,
    "mov $0x2 %ecx": 1001,
    "mov %ecx %r13d": 1002,
    "callq 0xa3": 1003,
    "mov %r14d %esi": 1004,
    "callq 0x52d84": 1005,
    "mov %rsp %rsi": 1006,
    "mov %r15 %rax": 1007,
    "jnbe 0x1a": 1008,
    "cmp %r12 %rbx": 1009,
    "sar $0x1f %edx": 1010,
    "shld %cl %r9 %rax": 1011,
    "jb 0x14": 1012,
    "movq (%rsi) %r9": 1013,
    "movq %r9 (%rdi)": 1014,
    "shl %cl %r9": 1015,
    "movq (%rax) %rdx": 1016,
    "cmp $0x3 %eax": 1017,
    "mov %esi %edi": 1018,
    "mov %esi %ecx": 1019,
    "movq (%rdi) %rax": 1020,
    "and $0xfff %eax": 1021,
    "mov %r15 %rsi": 1022,
    "bt %rdx %rax": 1023,
    "cmp $0x30 %r15d": 1024,
    "testl $0x400": 1025,
    "movb $0x0 (%rbx)": 1026,
    "mov %r13d %edx": 1027,
    "jz 0x38": 1028,
    "jnz 0xe1": 1029,
    "mov %r15d %r14d": 1030,
    "and $0x80 %eax": 1031,
    "mov %rsi %rax": 1032,
    "mov %r12 %r8": 1033,
    "cmp $0x2f %ecx": 1034,
    "add $0x8 %ecx": 1035,
    "sub $0x128 %rsp": 1036,
    "cmpl $0x50": 1037,
    "mov %r13 %r12": 1038,
    "jnb 0x3": 1039,
    "movsdq %xmm1": 1040,
    "movq (%rsp) %rax": 1041,
    "movq (%r14) %rax": 1042,
    "jnz 0x42": 1043,
    "jmp 0x4f": 1044,
    "test $0x10 %al": 1045,
    "shr $0x20 %rax": 1046,
    "mov %rsi %rdi": 1047,
    "jnz 0x1d": 1048,
    "shl $0x20 %rax": 1049,
    "cmp $0x9 %dl": 1050,
    "shr $0x4 %rax": 1051,
    "jz 0x41": 1052,
    "test $0x20 %al": 1053,
    "jnz 0x23": 1054,
    "cmp %rdx %rsi": 1055,
    "mov %r13 %rdx": 1056,
    "jz 0x6": 1057,
    "and $0x1 %edx": 1058,
    "movzxb (%rax) %edx": 1059,
    "movsdq (%rdx) %xmm0": 1060,
    "sub %eax %esi": 1061,
    "jnz 0x186d": 1062,
    "andb $0xef": 1063,
    "js 0x2d1": 1064,
    "movq (%rcx) %rdx": 1065,
    "jz 0x226": 1066,
    "test $0x1 %bl": 1067,
    "test $0x50 %bl": 1068,
    "test $0x40 %bl": 1069,
    "and $0x10 %ebx": 1070,
    "jnz 0x26ac": 1071,
    "jnbe 0xba7": 1072,
    "cmp %eax %edx": 1073,
    "jb 0x247": 1074,
    "sub %r9d %edx": 1075,
    "add %eax %r9d": 1076,
    "jz 0xe": 1077,
    "jmp 0x31": 1078,
    "movsx %r15b %r15d": 1079,
    "shl $0x2 %edx": 1080,
    "mov %r11d %edx": 1081,
    "shl $0x4 %edx": 1082,
    "shl $0x3 %edx": 1083,
    "mov %rsi %r11": 1084,
    "xor %ecx %eax": 1085,
    "add $0x4 %eax": 1086,
    "sar $0x6 %eax": 1087,
    "add $0x3f %eax": 1088,
    "lea %r14d": 1089,
    "jnz 0x939": 1090,
    "jle 0x111e": 1091,
    "cmp $0x2 %ecx": 1092,
    "mov $0xc %r13d": 1093,
    "jz 0xfb3": 1094,
    "movl (%rcx) %ecx": 1095,
    "cmp $0x65 %al": 1096,
    "jz 0x10d6": 1097,
    "cmpb $0x66": 1098,
    "movl $0x66": 1099,
    "jns 0x11": 1100,
    "movsxd %ecx %rdx": 1101,
    "jnz 0x8d2": 1102,
    "mov $0x66 %ebx": 1103,
    "jnbe 0x1418": 1104,
    "shr $0x2 %rax": 1105,
    "jnbe 0x1f": 1106,
    "setnb %al": 1107,
    "cmp %rdi %rdx": 1108,
    "cmp %rdx %rsp": 1109,
    "add $0x17 %r15": 1110,
    "and %r15": 1111,
    "sub %rax %rsp": 1112,
    "mov %ebx %r13d": 1113,
    "jnle 0x1d": 1114,
    "cmpl %r13d": 1115,
    "jle 0x3d4": 1116,
    "jnz 0x6": 1117,
    "cmpl %edx": 1118,
    "mov %r12 %r13": 1119,
    "mov %r13d %ebx": 1120,
    "setnz %sil": 1121,
    "cmp $0x35 %eax": 1122,
    "cmp $0x30 %eax": 1123,
    "and %sil %dil": 1124,
    "setnz %dil": 1125,
    "cmp $0x800 %si": 1126,
    "jz 0xcde": 1127,
    "and $0xc00 %si": 1128,
    "fnstcww": 1129,
    "jnbe 0x628": 1130,
    "test %si %si": 1131,
    "jnz 0x62f": 1132,
    "cmp $0x34 %eax": 1133,
    "jle 0x16": 1134,
    "cmp %r9d %ebx": 1135,
    "jz 0x158": 1136,
    "cmp $0x66 %edx": 1137,
    "movzxb %ebx": 1138,
    "sub %r14 %r13": 1139,
    "jnz 0x47c": 1140,
    "mov %r15 %r13": 1141,
    "jnz 0x473": 1142,
    "jnz 0xc55": 1143,
    "test $0x20 %bl": 1144,
    "sar $0x2 %rax": 1145,
    "jz 0xc42": 1146,
    "jle 0xc34": 1147,
    "jz 0x4a0": 1148,
    "cmpl $0x30": 1149,
    "jnz 0x44e": 1150,
    "jz 0x21": 1151,
    "jz 0xdc3": 1152,
    "jnz 0x138b": 1153,
    "add $0x17 %rax": 1154,
    "jbe 0x1296": 1155,
    "cmp %r14 %r15": 1156,
    "jmp 0x23": 1157,
    "jnz 0x125c": 1158,
    "jle 0x833": 1159,
    "jnz 0x1087": 1160,
    "jnb 0x59": 1161,
    "jnl 0xb2": 1162,
    "jmp 0x1e": 1163,
    "fstp %st (%rsp)": 1164,
    "mov $0x6 %edx": 1165,
    "movl $0x6": 1166,
    "jz 0xffb": 1167,
    "cmp $0x1 %rsi": 1168,
    "test $0x3f %al": 1169,
    "jnz 0x182c": 1170,
    "cmovns %eax %edx": 1171,
    "shr $0x1a %esi": 1172,
    "sub %esi %ecx": 1173,
    "sar $0x1f %esi": 1174,
    "add %rdx %rsi": 1175,
    "add %ecx %r14d": 1176,
    "cmovns %r14d %edx": 1177,
    "mov %r13d %r14d": 1178,
    "jmp 0x67": 1179,
    "mov %r14d %r12d": 1180,
    "testb $0x10": 1181,
    "jnz 0x7e5": 1182,
    "movq (%r15) %rax": 1183,
    "jle 0x6c": 1184,
    "xor $0x3f %rsi": 1185,
    "jnz 0x2159": 1186,
    "bsrq %rsi": 1187,
    "jmp 0x25": 1188,
    "cmp %r8d %r15d": 1189,
    "mov $0x40 %r15d": 1190,
    "sub %ecx %r15d": 1191,
    "movsxd %ebx %rbx": 1192,
    "jnbe 0x1435": 1193,
    "jle 0x1b43": 1194,
    "jle 0x14a5": 1195,
    "movl %ebx (%rax)": 1196,
    "cmpq $0x0 (%r10)": 1197,
    "jnle 0x19": 1198,
    "callq 0x55402": 1199,
    "callq 0x1b833": 1200,
    "callq 0x1b24c": 1201,
    "callq 0x1b228": 1202,
    "subq %rbx": 1203,
    "jmp 0x59": 1204,
    "mov %rdx %r10": 1205,
    "add %rax %r10": 1206,
    "mov $0x0 %r8d": 1207,
    "mov %r8 %r9": 1208,
    "adc %rdx %r9": 1209,
    "orl $0x40": 1210,
    "jnz 0xcf": 1211,
    "jz 0x16a0": 1212,
    "jnb 0x1668": 1213,
    "cmp $0xa %r13d": 1214,
    "jnz 0x1a49": 1215,
    "jz 0xf5": 1216,
    "jz 0x2833": 1217,
    "jz 0x1436": 1218,
    "jz 0x10d0": 1219,
    "cmp $0x1 %rdx": 1220,
    "jnz 0x1038": 1221,
    "jz 0x1071": 1222,
    "jz 0x2c19": 1223,
    "jz 0x13ae": 1224,
    "and $0x80 %ecx": 1225,
    "and $0x40 %eax": 1226,
    "callq 0x5d2bd": 1227,
    "movq %rdi (%rbx)": 1228,
    "jz 0x2be8": 1229,
    "and $0x8 %edi": 1230,
    "jnz 0x1219": 1231,
    "jz 0x1615": 1232,
    "jz 0x2b15": 1233,
    "movq (%rdx) %rdx": 1234,
    "add $0x1 %r9d": 1235,
    "cmp %rax %rdi": 1236,
    "jz 0x14c": 1237,
    "bswap %rdx": 1238,
    "add $0x8 %rax": 1239,
    "jnz 0x57e": 1240,
    "jmp 0x80": 1241,
    "mov %r12 %r15": 1242,
    "callq 0x1480b": 1243,
    "mov %r15d": 1244,
    "movl %eax (%rdx)": 1245,
    "movl %eax (%rdi)": 1246,
    "test %r15b %r15b": 1247,
    "mov %r12 %rdx": 1248,
    "movq %rax (%rbp)": 1249,
    "xor %edx %eax": 1250,
    "jz 0xa": 1251,
    "sub $0x3f %eax": 1252,
    "or %rdx %rax": 1253,
    "testb $0x4": 1254,
    "jb 0xaa": 1255,
    "jnb 0x1e": 1256,
    "cmpw $0x0": 1257,
    "callq 0x70": 1258,
    "callq 0xed0f": 1259,
    "callq 0x3b": 1260,
    "jz 0x37": 1261,
    "shl $0x10 %edx": 1262,
    "movzxw (%rdi) %edx": 1263,
    "imul %rcx %rax": 1264,
    "shl $0xf %eax": 1265,
    "shr $0x1 %dx": 1266,
    "movzx %dx %edx": 1267,
    "callq 0xecdf": 1268,
    "cmp %rbx": 1269,
    "js 0x132": 1270,
    "jb 0xb3": 1271,
    "jnbe 0x82": 1272,
    "mov %edx %r13d": 1273,
    "jz 0xdf3": 1274,
    "testl $0x200": 1275,
    "jnz 0xee9": 1276,
    "jnbe 0x1743": 1277,
    "add %r14 %r12": 1278,
    "add %rbp %r12": 1279,
    "jb 0x1a8": 1280,
    "xor %edi %edi": 1281,
    "movsxd %ebx %r15": 1282,
    "mov %rdi %r15": 1283,
    "mov $0x30 %esi": 1284,
    "callq 0x2ff5": 1285,
    "jz 0x29": 1286,
    "jle 0x59": 1287,
    "mov %ecx %ebx": 1288,
    "cmp $0xf %ecx": 1289,
    "jle 0x34": 1290,
    "jbe 0x33": 1291,
    "movsxd %ebx %rdx": 1292,
    "jnz 0x1b": 1293,
    "add %rax %r12": 1294,
    "cmp %ebx %eax": 1295,
    "mov %ecx": 1296,
    "callq 0x55694": 1297,
    "mov %edx %r14d": 1298,
    "callq 0xf14b": 1299,
    "mov %esi %r15d": 1300,
    "cmp $0x7f %eax": 1301,
    "callq 0xdb61": 1302,
    "callq 0xff1": 1303,
    "add $0x1 %cl": 1304,
    "mov %al %cl": 1305,
    "movb %bl": 1306,
    "callq 0x5f4f4": 1307,
    "add %rsi %rdx": 1308,
    "mov %rsi %rcx": 1309,
    "and $0x7f %ecx": 1310,
    "movzxw (%rcx) %edx": 1311,
    "test %dx %dx": 1312,
    "jnz 0x15b": 1313,
    "jnl 0x2e": 1314,
    "bswap %eax": 1315,
    "sub $0x1 %ebx": 1316,
    "mov %rbx": 1317,
    "test %edi %edi": 1318,
    "movq %r12 %xmm0": 1319,
    "jnl 0x7e": 1320,
    "movl %ecx (%rdi)": 1321,
    "imull %eax": 1322,
    "jz 0xc8": 1323,
    "jz 0x1c": 1324,
    "%xmm0": 1325,
    "shr $0x4 %rbx": 1326,
    "mov %ecx %edi": 1327,
    "jnz 0x86": 1328,
    "popq %rax": 1329,
    "jz 0x75": 1330,
    "vmovq %xmm0 %rcx": 1331,
    "bswap %ecx": 1332,
    "jnl 0x2c": 1333,
    "jz 0x12": 1334,
    "lea %r9": 1335,
    "jnle 0x37": 1336,
    "jnl 0x51": 1337,
    "add $0x9 %eax": 1338,
    "jnl 0x28": 1339,
    "callq 0xf02a": 1340,
    "callq 0xe8a2": 1341,
    "callq 0xf057": 1342,
    "sub %ecx %eax": 1343,
    "shl $0x8 %ecx": 1344,
    "shl $0x8 %eax": 1345,
    "movzxw (%rsi) %ecx": 1346,
    "movzxw (%rdi) %eax": 1347,
    "mov %ebx %ecx": 1348,
    "nop": 1349,
    "mov %r8 %rcx": 1350,
    "callq 0xf166": 1351,
    "add $0x2 %ecx": 1352,
    "callq 0xf2d5": 1353,
    "mov %r15d %edx": 1354,
    "jnb 0x22": 1355,
    "callq 0xf0b1": 1356,
    "pushq %rax": 1357,
    "%ymm1": 1358,
    "jz 0x40": 1359,
    "cmp $0x10 %r9d": 1360,
    "cmpq %r12": 1361,
    "idiv %rcx": 1362,
    "cqo": 1363,
    "vmovapd %xmm0 %xmm2": 1364,
    "jnbe 0xa5": 1365,
    "cmp $0x40 %rdx": 1366,
    "jnz 0x2f": 1367,
    "jbe 0x17e": 1368,
    "mov $0xbb8 %ecx": 1369,
    "cmp %r8 %rax": 1370,
    "%ymm0 (%rdi)": 1371,
    "(%rsi) %ymm0": 1372,
    "jle 0x32": 1373,
    "mov %rdi %r8": 1374,
    "jnbe 0xfa6": 1375,
    "callq %rax": 1376,
    "mov $0x3 %eax": 1377,
    "cmp $0x3ff %r13": 1378,
    "jnz 0x29c": 1379,
    "jnl 0x96": 1380,
    "movapd %xmm0 %xmm1": 1381,
    "jnl 0xfa": 1382,
    "jz 0x6e": 1383,
    "cmp $0x1f %rbx": 1384,
    "jbe 0x2a4": 1385,
    "callq 0xe8d8": 1386,
    "callq 0xe8c4": 1387,
    "callq %r15": 1388,
    "callq 0xf04f": 1389,
    "mov $0x29 %eax": 1390,
    "callq 0x52e9e": 1391,
    "mov $0x2 %edi": 1392,
    "movw $0x2": 1393,
    "mov $0x10 %eax": 1394,
    "callq 0x504ae": 1395,
    "callq 0x4f89a": 1396,
    "cmovb %rdx %rbx": 1397,
    "movq %rbx %xmm1": 1398,
    "cmpq %r9": 1399,
    "movb $0x0 (%rdx)": 1400,
    "add $0x158 %rsp": 1401,
    "popq %rdx": 1402,
    "jbe 0x1e7": 1403,
    "cmp $0x40 %ecx": 1404,
    "jnz 0x123": 1405,
    "vmovsdq %xmm2": 1406,
    "jz 0x9f": 1407,
    "jz 0x95": 1408,
    "test $0xf %sil": 1409,
    "jnz 0x29e": 1410,
    "jz 0x3a": 1411,
    "jbe 0x29": 1412,
    "andpdx %xmm1": 1413,
    "movb $0x0 (%rbp)": 1414,
    "jnl 0x7a": 1415,
    "js 0x60d": 1416,
    "jz 0x504": 1417,
    "shr $0x4 %r14d": 1418,
    "jbe 0x272": 1419,
    "add $0x88 %rsp": 1420,
    "nopl %eax (%rax)": 1421,
    "and $0x2 %ebp": 1422,
    "movl (%rbx) %ebp": 1423,
    "jz 0x10f": 1424,
    "sub %rdx %rsi": 1425,
    "jnz 0x846": 1426,
    "or $0x1 %rax": 1427,
    "jnz 0x39": 1428,
    "callq 0xf028": 1429,
    "sub $0x538 %rsp": 1430,
    "cmp $0x10 %edx": 1431,
    "jnb 0x10b": 1432,
    "jnb 0xe2": 1433,
    "cmp $0x8 %edx": 1434,
    "cmp $0x4 %edx": 1435,
    "jnb 0xc9": 1436,
    "add %rcx %rsi": 1437,
    "mov $0x1 %r11d": 1438,
    "add $0x48 %rsp": 1439,
    "movq %xmm0 %rcx": 1440,
    "movq %xmm0 %rax": 1441,
    "mov $0x12 %esi": 1442,
    "mov %edx %r8d": 1443,
    "shr $0x18 %eax": 1444,
    "callq 0x531a2": 1445,
    "movzx %r9b %r9d": 1446,
    "movzx %dil %ecx": 1447,
    "shr $0x10 %r9d": 1448,
    "movq %fs: %rsi": 1449,
    "mov %edi %r9d": 1450,
    "movzx %ah %edx": 1451,
    "bsf %edx %edx": 1452,
    "jnb 0x134": 1453,
    "cmp $0x20 %edx": 1454,
    "jbe 0x25": 1455,
    "cmp $0x3 %edi": 1456,
    "test $0x1 %al": 1457,
    "mov %r9d %r13d": 1458,
    "mov %rcx %r15": 1459,
    "mov %rsp %rcx": 1460,
    "movl $0x18 (%rsp)": 1461,
    "callq 0x89cf": 1462,
    "jnz 0x205": 1463,
    "%ymm1 %edx": 1464,
    "(%rsi) %ymm0 %ymm1": 1465,
    "shr %cl %rdx": 1466,
    "movl (%rsi) %ecx": 1467,
    "lea %r11": 1468,
    "sub $0x48 %rsp": 1469,
    "mov $0x1 %al": 1470,
    "jnbe 0x1200": 1471,
    "cmp $0xaf %eax": 1472,
    "add $0x10 %eax": 1473,
    "jp 0x2257": 1474,
    "ucomisd %xmm0 %xmm0": 1475,
    "jbe 0x2de": 1476,
    "movq %xmm0 %rsi": 1477,
    "and %rax %rsi": 1478,
    "shr $0x34 %rcx": 1479,
    "shr $0x30 %rax": 1480,
    "sub $0x3ff %ecx": 1481,
    "movl %ecx (%rdx)": 1482,
    "shr $0x3f %rsi": 1483,
    "and $0x7ff %ecx": 1484,
    "callq 0x1e9b6": 1485,
    "movl %esi (%rcx)": 1486,
    "bts $0x34 %rsi": 1487,
    "jnbe 0x43": 1488,
    "fstp %st %st(0)": 1489,
    "movzx %dl %esi": 1490,
    "cmp %r11 %r10": 1491,
    "shr $0x5 %edi": 1492,
    "cmp %esi %eax": 1493,
    "jnbe 0x1ae": 1494,
    "jbe 0x262": 1495,
    "callq 0x260b": 1496,
    "add %rax %r13": 1497,
    "movssl %xmm0": 1498,
    "jz 0x2c9": 1499,
    "fld (%rax) %st": 1500,
    "add $0xf %rax": 1501,
    "fucomi %st(0) %st": 1502,
    "jp 0x22a4": 1503,
    "fld (%rdx) %st": 1504,
    "jbe 0xa03": 1505,
    "fld %st(1) %st": 1506,
    "fucomip %st(1) %st": 1507,
    "fabs": 1508,
    "sub $0x88 %rsp": 1509,
    "jnbe 0x108": 1510,
    "cmovnbe %r13 %rax": 1511,
    "jz 0x337": 1512,
    "jb 0x218": 1513,
    "setnz %dl": 1514,
    "movl %edx (%rbx)": 1515,
    "movapsx %xmm5": 1516,
    "movapsx %xmm1": 1517,
    "movapsx %xmm7": 1518,
    "movapsx %xmm6": 1519,
    "movapsx %xmm2": 1520,
    "movapsx %xmm4": 1521,
    "movapsx %xmm3": 1522,
    "shr $0x7 %al": 1523,
    "popq %rsi": 1524,
    "popq %rcx": 1525,
    "jnz 0x17d6": 1526,
    "add $0x8 %r14": 1527,
    "add $0x8 %rsi": 1528,
    "jz 0x4cb": 1529,
    "tzcnt %r8 %rax": 1530,
    "jz 0x77b": 1531,
    "mov %eax %r8d": 1532,
    "movsxd %ebx %r13": 1533,
    "cmp %r8d %eax": 1534,
    "tzcnt %r9 %r8": 1535,
    "jle 0x52a": 1536,
    "cmovle %eax %r8d": 1537,
    "jz 0x25": 1538,
    "jnbe 0x2ab": 1539,
    "and %rbx": 1540,
    "or %rax": 1541,
    "movzxb %edi": 1542,
    "jnz 0x1d06": 1543,
    "tzcnt %r8 %r8": 1544,
    "jnle 0x2f7": 1545,
    "callq 0x1e35f": 1546,
    "movq %rcx (%rdi)": 1547,
    "jnb 0x13f7": 1548,
    "lea %r13d": 1549,
    "movsxb %ebx": 1550,
    "setnle %r15b": 1551,
    "jnz 0x1c45": 1552,
    "jnbe 0x167b": 1553,
    "jnb 0x1fd7": 1554,
    "movl (%rdx) %edx": 1555,
    "callq 0x7b29": 1556,
    "or %r13 %rdx": 1557,
    "shl $0x2 %rdx": 1558,
    "or $0x1 %rdx": 1559,
    "mov %rsi %rbx": 1560,
    "addq %rdi": 1561,
    "cmp %rax %rbx": 1562,
    "movq %rax (%rsp)": 1563,
    "jz 0x2118": 1564,
    "jz 0xb54": 1565,
    "jnb 0x1ab4": 1566,
    "callq 0x7cec": 1567,
    "mov $0x2d %esi": 1568,
    "mov %rbx %r12": 1569,
    "jz 0x673": 1570,
    "cmpq %r8": 1571,
    "jb 0x21b": 1572,
    "movzxw (%rdi) %r8d": 1573,
    "mov %rax %r12": 1574,
    "shr $0x9 %rdi": 1575,
    "vmovq %xmm0 %rdx": 1576,
    "jnz 0x244": 1577,
    "add $0x10 %r8": 1578,
    "add $0x38 %rsp": 1579,
    "cmp $0x2 %edi": 1580,
    "%xmm2 %xmm0": 1581,
    "add $0x1 %rbx": 1582,
    "shl $0x5 %rax": 1583,
    "movsdq %xmm3": 1584,
    "ucomisd %xmm6 %xmm0": 1585,
    "pxor %xmm6 %xmm6": 1586,
    "cmpl $0x1e": 1587,
    "jz 0x112": 1588,
    "jz 0x9e": 1589,
    "and $0x7ff %eax": 1590,
    "ucomisd %xmm5 %xmm3": 1591,
    "andpd %xmm4 %xmm5": 1592,
    "vmovq %rax %xmm0": 1593,
    "shr $0x34 %rdx": 1594,
    "jb 0x11": 1595,
    "movapd %xmm0 %xmm5": 1596,
    "movsdq (%rsp) %xmm2": 1597,
    "movqq %xmm4": 1598,
    "jnp 0x37": 1599,
    "jnbe 0x1da": 1600,
    "sub $0x3be %eax": 1601,
    "add $0x30 %rsp": 1602,
    "sub $0x1 %edx": 1603,
    "setnzb": 1604,
    "mov %rax %rbp": 1605,
    "movsxb %rbp": 1606,
    "add $0x1 %r12": 1607,
    "mov $0x1 %edi": 1608,
    "jle 0x10": 1609,
    "jz 0x1f41": 1610,
    "jz 0x308c": 1611,
    "movb %r14b (%r12)": 1612,
    "mov $0x1 %r13d": 1613,
    "jnb 0x209": 1614,
    "add $0x1 %r10": 1615,
    "jbe 0x18": 1616,
    "cmp $0x9 %cl": 1617,
    "movsxb (%r12) %rax": 1618,
    "jz 0xf2": 1619,
    "sub $0x1 %ebp": 1620,
    "sub $0x1 %rbx": 1621,
    "vmovq %xmm1 %r8": 1622,
    "vmovq %xmm1 %r9": 1623,
    "cmp $0x7fd %eax": 1624,
    "shr $0x34 %r9": 1625,
    "vmovq %xmm0 %rsi": 1626,
    "movsdq %xmm0 (%rsp)": 1627,
    "%xmm1 %xmm0 %xmm0": 1628,
    "jz 0x4f": 1629,
    "mov %edi %r8d": 1630,
    "cmp $0x1 %r8d": 1631,
    "callq 0x325": 1632,
    "mov %eax %edi": 1633,
    "callq 0xf035": 1634,
    "jnz 0x1eb": 1635,
    "jz 0x10a": 1636,
    "movb $0x1": 1637,
    "movw %cx (%rdi)": 1638,
    "mov %r14d %edx": 1639,
    "mov %rsi %rdx": 1640,
    "mov %eax %r12d": 1641,
    "jz 0x133": 1642,
    "jmp 0xc": 1643,
    "cmp %r14 %r10": 1644,
    "mov %esi %ebp": 1645,
    "mov $0x10 %ebp": 1646,
    "sub %rax %rbp": 1647,
    "movq (%rbx) %r14": 1648,
    "sub $0x30 %rsp": 1649,
    "mov %esi %r8d": 1650,
    "cmp $0xbf %eax": 1651,
    "subq %rsi": 1652,
    "jz 0x2d": 1653,
    "cmp $0x3ff %rax": 1654,
    "movq %rax (%rbx)": 1655,
    "mov %ebp %esi": 1656,
    "movq (%r8) %rsi": 1657,
    "movw %dx (%rcx)": 1658,
    "cmp %r8 %rcx": 1659,
    "add %rbx %rax": 1660,
    "jz 0x374": 1661,
    "jnl 0x194": 1662,
    "cmpl %esi": 1663,
    "mov %rdi %r14": 1664,
    "jz 0xd": 1665,
    "mov $0x0 %rbp": 1666,
    "jnz 0x72": 1667,
    "jnz 0x238": 1668,
    "mov $0x4 %edx": 1669,
    "movzxb (%rdi) %eax": 1670,
    "sub %rcx %rax": 1671,
    "mov %rcx %rsi": 1672,
    "and $0x3 %esi": 1673,
    "mov $0x16d %eax": 1674,
    "jnl": 1675,
    "mov $0xb %eax": 1676,
    "callq 0x384b8": 1677,
    "test $0x202 %eax": 1678,
    "%eax": 1679,
    "jbe 0x68": 1680,
    "cmp %rcx %rdx": 1681,
    "addsd %xmm1 %xmm0": 1682,
    "mulsdq %xmm1": 1683,
    "%xmm0 %rax": 1684,
    "jnz 0x22b": 1685,
    "cmp $0x1 %edi": 1686,
    "jnz 0x249": 1687,
    "cmp $0xe0 %eax": 1688,
    "jbe 0x1f6": 1689,
    "cmpq %r14": 1690,
    "%rdx %xmm0": 1691,
    "add $0x1 %rcx": 1692,
    "%rax %xmm0": 1693,
    "movsxdl %rbx": 1694,
    "jnbe 0x9": 1695,
    "jz 0x228": 1696,
    "add $0x2 %rax": 1697,
    "shr $0x6 %rax": 1698,
    "movl $0x77": 1699,
    "movl $0x6e": 1700,
    "add $0x30 %eax": 1701,
    "add $0x5b %edi": 1702,
    "movl $0x7c": 1703,
    "sub $0x18 %rbx": 1704,
    "jz 0x588": 1705,
    "sub $0x1 %r13d": 1706,
    "movq (%rbx) %r12": 1707,
    "jnl 0x211": 1708,
    "cmpl $0x23": 1709,
    "jnbe 0x30": 1710,
    "mov $0x5 %eax": 1711,
    "js 0x73": 1712,
    "jz 0x83": 1713,
    "jnbe 0x4e": 1714,
    "jz 0x53": 1715,
    "vmovsdq %xmm12": 1716,
    "vmovsdq %xmm11": 1717,
    "vmovsdq %xmm4": 1718,
    "vmovsdq %xmm7": 1719,
    "jnz 0x34": 1720,
    "jnle 0x22": 1721,
    "cmp $0xef %eax": 1722,
    "movl $0xd": 1723,
    "fld %st(0) %st": 1724,
    "fldq %st": 1725,
    "movl $0x15": 1726,
    "movb $0x72": 1727,
    "callq 0xf1bc": 1728,
    "callq 0xf19c": 1729,
    "callq 0xf16e": 1730,
    "callq 0xf144": 1731,
    "callq 0xf123": 1732,
    "callq 0xf101": 1733,
    "callq 0xf0e1": 1734,
    "callq 0xf0b3": 1735,
    "callq 0xf08c": 1736,
    "callq 0xf061": 1737,
    "jbe 0xff": 1738,
    "jnz 0x97": 1739,
    "add $0xa0 %rsp": 1740,
    "mov $0x2 %edx": 1741,
    "and %rcx %rdx": 1742,
    "vxorps %xmm3 %xmm3 %xmm3": 1743,
    "sar $0x34 %rcx": 1744,
    "shr $0x2d %rax": 1745,
    "vmovsdq %xmm10": 1746,
    "%ecx %xmm3 %xmm3": 1747,
    "and $0x7f %eax": 1748,
    "vaddsdq %xmm1 %xmm3": 1749,
    "vaddsd %xmm0 %xmm1 %xmm1": 1750,
    "%xmm3 %xmm2": 1751,
    "shl $0x2d %rax": 1752,
    "vmulsd %xmm1 %xmm1 %xmm0": 1753,
    "vmovq %xmm2 %rsi": 1754,
    "vsubsd %xmm3 %xmm2 %xmm2": 1755,
    "vmovsdq %xmm3": 1756,
    "%xmm1 %xmm2": 1757,
    "movzx %r15b %eax": 1758,
    "jnl 0x40": 1759,
    "jbe 0x73": 1760,
    "cmp %rdi %rax": 1761,
    "sub $0xa0 %rsp": 1762,
    "js 0xae": 1763,
    "sub %rbp %rax": 1764,
    "jle 0x996": 1765,
    "movq (%rax) %rax": 1766,
    "jmp 0x18": 1767,
    "cmp $0x30 %bpl": 1768,
    "sub %rax %rcx": 1769,
    "jnz 0xb3": 1770,
    "mov %r9 %rdx": 1771,
    "mov $0x3f %ecx": 1772,
    "orl $0x3": 1773,
    "jz 0x2a73": 1774,
    "jnb 0x2a3b": 1775,
    "jnz 0x19ce": 1776,
    "sub %eax %edi": 1777,
    "cmp $0x6e %eax": 1778,
    "jz 0x1dfb": 1779,
    "jnz 0x2424": 1780,
    "cmp $0x69 %eax": 1781,
    "jz 0x136c": 1782,
    "jnz 0x1362": 1783,
    "movl $0x65": 1784,
    "movb $0x65": 1785,
    "jz 0x32b1": 1786,
    "mov %r12d %r13d": 1787,
    "jmp 0x68": 1788,
    "and $0x800 %edi": 1789,
    "mov %r14d %r15d": 1790,
    "jz 0x26aa": 1791,
    "subq %rdx": 1792,
    "jnz 0x2536": 1793,
    "jz 0x2521": 1794,
    "jnz 0x24f6": 1795,
    "mov %r13 %r8": 1796,
    "jz 0x3fe7": 1797,
    "and $0x8 %ebx": 1798,
    "jz 0x220c": 1799,
    "and $0x80 %edx": 1800,
    "jnz 0x418c": 1801,
    "jz 0x21f0": 1802,
    "callq 0x5cbac": 1803,
    "jmp 0x61e1": 1804,
    "sub $0x648 %rsp": 1805,
    "mov %rcx %r8": 1806,
    "orq $0x0 (%rsp)": 1807,
    "sub %rsp": 1808,
    "jz 0x2127": 1809,
    "movsxb %rax": 1810,
    "jz 0x318": 1811,
    "cmp $0x2d %al": 1812,
    "jz 0x230": 1813,
    "cmp $0x2b %al": 1814,
    "movzxb (%r13) %eax": 1815,
    "jz 0x7f": 1816,
    "jbe 0x6a": 1817,
    "jz 0xcff": 1818,
    "mov $0xa %r9d": 1819,
    "cmpq $0x0 (%rsp)": 1820,
    "jnz 0x46": 1821,
    "mov $0x1 %r12d": 1822,
    "jnz 0x1fc8": 1823,
    "add %rsp": 1824,
    "jnz 0x21ad": 1825,
    "jz 0x5ff9": 1826,
    "jnz 0x5f49": 1827,
    "jnbe 0x5b3a": 1828,
    "cmp $0x2f %esi": 1829,
    "fstp %st (%rcx)": 1830,
    "add $0x8 %esi": 1831,
    "jz 0x5aae": 1832,
    "addq %rcx": 1833,
    "jnle 0x7e": 1834,
    "jnz 0x2d": 1835,
    "movq %rax (%rcx)": 1836,
    "jz 0xd0": 1837,
    "shr $0x6 %rcx": 1838,
    "shl $0x2 %rbx": 1839,
    "callq 0x1184d": 1840,
    "jz 0x18c": 1841,
    "jbe 0x11a5": 1842,
    "mov %r12 %rbx": 1843,
    "jz 0x15c": 1844,
    "jnz 0x11dd": 1845,
    "neg %rcx": 1846,
    "jz 0x1a8": 1847,
    "test %r10 %r10": 1848,
    "cmpb %al": 1849,
    "mov %r10 %r14": 1850,
    "js 0x1e70": 1851,
    "jnz 0x23f": 1852,
    "cmp $0x65 %dl": 1853,
    "jnb 0x32": 1854,
    "cmp %r10 %r14": 1855,
    "jnz 0x94d": 1856,
    "jz 0x944": 1857,
    "js 0xe38": 1858,
    "jz 0xbf7": 1859,
    "movq %rsi (%rax)": 1860,
    "jz 0x89": 1861,
    "jz 0x93f": 1862,
    "js 0xde5": 1863,
    "jnle 0x14bb": 1864,
    "cmovnle %rcx %rax": 1865,
    "sub %r10 %rax": 1866,
    "jl 0x1734": 1867,
    "jnz 0xfc8": 1868,
    "mov %rcx %r14": 1869,
    "mov %r9 %r13": 1870,
    "movq (%rsi) %rcx": 1871,
    "movq (%r14) %rdx": 1872,
    "movq $0x1 (%r14)": 1873,
    "movq %rbx (%r15)": 1874,
    "jle 0x11e": 1875,
    "popq %r11": 1876,
    "movl %r10d (%rsp)": 1877,
    "mov %r9d %r10d": 1878,
    "jnle 0x351": 1879,
    "shl $0x6 %r10d": 1880,
    "cmp $0x40 %r10d": 1881,
    "jnle 0x5fc": 1882,
    "jz 0x6c5": 1883,
    "shr $0x1a %edx": 1884,
    "cmp $0x3f %eax": 1885,
    "sub %r9 %r14": 1886,
    "and $0x3f %eax": 1887,
    "jz 0x188": 1888,
    "sub %eax %ecx": 1889,
    "callq 0x7a7": 1890,
    "jle 0xb": 1891,
    "mov %r9d %r14d": 1892,
    "movsxd %ebx %rsi": 1893,
    "jnbe 0x161": 1894,
    "jnl 0x165": 1895,
    "jnle 0x100": 1896,
    "and $0x1 %r15d": 1897,
    "and $0x1 %r8d": 1898,
    "movq (%rbp) %rsi": 1899,
    "shr %cl %r15": 1900,
    "setnz %r14b": 1901,
    "jz 0x1d4": 1902,
    "and %rax %rdx": 1903,
    "not %rax": 1904,
    "cmp $0x800 %r12d": 1905,
    "shl %cl %rax": 1906,
    "jnle 0x128": 1907,
    "jz 0xd8": 1908,
    "or %r14d %r8d": 1909,
    "test %r14b %r14b": 1910,
    "jnz 0xea": 1911,
    "movw %si": 1912,
    "callq 0x4146": 1913,
    "and %si": 1914,
    "add %si": 1915,
    "shl $0xf %edx": 1916,
    "or %edx %esi": 1917,
    "jnz 0x27d": 1918,
    "callq 0xf182": 1919,
    "shl $0x4 %rax": 1920,
    "add $0x3 %ecx": 1921,
    "callq 0xf2ee": 1922,
    "shl $0x4 %rcx": 1923,
    "jl 0x38": 1924,
    "jz 0x135": 1925,
    "callq 0x1025": 1926,
    "jnz 0x150": 1927,
    "jz 0xe3": 1928,
    "cmp %rsi %rax": 1929,
    "lea %r11d": 1930,
    "cmp %r13": 1931,
    "lea %r15d": 1932,
    "shr $0x12 %rax": 1933,
    "shr $0xf %r15": 1934,
    "shr $0xc %rsi": 1935,
    "cmovnbe %rdx %rax": 1936,
    "callq 0xf0e3": 1937,
    "callq 0xf18b": 1938,
    "jnl 0x207": 1939,
    "mov %ecx %eax": 1940,
    "faddp %st %st(1)": 1941,
    "fmulp %st %st(1)": 1942,
    "add %ecx": 1943,
    "add %eax": 1944,
    "jz 0x50": 1945,
    "movq %rdx %xmm1": 1946,
    "cmp %rax %rbp": 1947,
    "mov $0x14 %edx": 1948,
    "callq 0xf771": 1949,
    "callq 0xf8f0": 1950,
    "jnz 0x961": 1951,
    "and $0x8 %esi": 1952,
    "and $0x1 %ecx": 1953,
    "test $0x21 %ah": 1954,
    "jz 0x381c": 1955,
    "jnz 0x31aa": 1956,
    "jnbe 0xc4f": 1957,
    "jz 0x341f": 1958,
    "jnb 0x36b4": 1959,
    "jnz 0x366c": 1960,
    "jmp 0x66": 1961,
    "and %ebx": 1962,
    "callq 0x1389a": 1963,
    "movb $0x0 (%rax)": 1964,
    "testl": 1965,
    "movw $0x0": 1966,
    "movw %bx": 1967,
    "movw %ax (%rcx)": 1968,
    "movsxw %ebx": 1969,
    "movsxw %r14d": 1970,
    "movsxw %r12d": 1971,
    "movsxw %r15d": 1972,
    "callq 0xf6ea": 1973,
    "mov %r12d %r8d": 1974,
    "jl 0x30": 1975,
    "cmp $0x0 %eax": 1976,
    "jle 0x22": 1977,
    "sar $0x3f %rax": 1978,
    "jmp 0x11": 1979,
    "test %r13b %r13b": 1980,
    "jnb 0x20": 1981,
    "movq %rdx %xmm0": 1982,
    "movq %rcx %xmm2": 1983,
    "movl %ecx (%rbp)": 1984,
    "or $0x8 %ch": 1985,
    "sub $0x38 %rsp": 1986,
    "jnl 0x22": 1987,
    "add %r14 %rax": 1988,
    "cmp $0x3 %rdx": 1989,
    "cmp $0x4 %rdx": 1990,
    "jnz 0x8f": 1991,
    "jmp 0x17b": 1992,
    "jnz 0xa8": 1993,
    "jnz 0x26b": 1994,
    "jmp 0xaf": 1995,
    "jz 0x2e": 1996,
    "mov %edi %edx": 1997,
    "jnle 0x32": 1998,
    "cmpl $0x5a": 1999,
    "addq $0x1": 2000,
    "mov %rbp": 2001,
    "mov %r14d %eax": 2002,
    "mov $0x0 %r13": 2003,
    "jz 0x242": 2004,
    "jnz 0x297": 2005,
    "jmp 0x1d": 2006,
